In [2]:
# -*- coding: utf-8 -*-
%matplotlib inline
from datetime import datetime
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib as mpl
import re,math
import pandas as pd

### Connection between  invoice <-> "company's classification"

In [22]:
# load company data
data = pd.read_csv('industry_3.csv')

In [24]:
del data['detail']
data.head()

          num   class1              big              mid
0  1000000000       不拘               不拘               不拘
1  1001000000    電子製造業  電子資訊 ／軟體／半導體相關業  電子資訊 ／軟體／半導體相關業
2  1001001000  知識密集服務業  電子資訊 ／軟體／半導體相關業         軟體及網路相關業
3  1001001001  知識密集服務業  電子資訊 ／軟體／半導體相關業         軟體及網路相關業
4  1001001002  知識密集服務業  電子資訊 ／軟體／半導體相關業         軟體及網路相關業

In [3]:
# read job_structured.csv 
companyno = pd.read_csv('/Users/youngmihuang/Desktop/104/data/job_structured_info.csv', sep='|')

In [13]:
# choose specified columns
company1 = companyno[['invoice','industry','jobno']]

In [10]:
# change column names : use rename
company2 = company1.rename(columns = {"industry":"num"})
company2.head()

    invoice         num
0   4541302  1001003003
1  22099218  1001006001
2  84149738  1001004002
3  76027628  1001006002
4   4541302  1001003003

In [45]:
# merge company2 and original data
join1 = pd.merge(company2, data, on='num', how='left')

In [46]:
# save to .csv
join1.to_csv('mapping_class.csv', index = False)

### Connection between  invoice <-> "job's classification"

In [4]:
# arrange job_info.csv
# vertical integration start
company3 = companyno[['invoice','jobno','jobcat1','jobcat2','jobcat3']]
company3.head()

    invoice    jobno     jobcat1     jobcat2     jobcat3
0   4541302   788127  2008001006  2008001010  2008001007
1  22099218   881206  2008001016  2009003006  2008001009
2  84149738   962383  2008001009  2008001018  2007001005
3  76027628  3338171  2003001009  2003001003  2003001004
4   4541302  3716258  2010001009  2009002001           0

In [8]:
company4 = companyno[['invoice', 'jobno', 'jobcat1']]
company5 = companyno[['invoice', 'jobno', 'jobcat2']]
company6 = company5.rename( columns ={'jobcat2': 'jobcat1'})
company6.head()

    invoice    jobno     jobcat1
0   4541302   788127  2008001010
1  22099218   881206  2009003006
2  84149738   962383  2008001018
3  76027628  3338171  2003001003
4   4541302  3716258  2009002001

In [9]:
company7 = companyno[['invoice', 'jobno', 'jobcat3']]
company8 = company7.rename( columns ={'jobcat3': 'jobcat1'})

In [10]:
# vertical integration finish
company8 = pd.concat([company4 , company6, company8], axis =0)
company8.head()

    invoice    jobno     jobcat1
0   4541302   788127  2008001006
1  22099218   881206  2008001016
2  84149738   962383  2008001009
3  76027628  3338171  2003001009
4   4541302  3716258  2010001009

In [11]:
# load jobtitle data
jobtitle = pd.read_csv('/Users/youngmihuang/Desktop/104/category/job_category_1.csv')
jobtitle1 = jobtitle.loc[: ,['類目代碼','big','mid', 'manager_ind']]
jobtitle1.head()

         類目代碼     big       mid  manager_ind
0  2001000000  經營／人資類    經營／人資類            0
1  2001001000  經營／人資類  經營／幕僚類人員            0
2  2001001001  經營／人資類  經營／幕僚類人員            1
3  2001001002  經營／人資類  經營／幕僚類人員            0
4  2001001003  經營／人資類  經營／幕僚類人員            0

In [12]:
# rename
jobtitle3 = jobtitle1.rename(columns = {"類目代碼": "jobcat1"})

In [13]:
# merge job_info & job_title 
join_job = pd.merge(company8, jobtitle3, on='jobcat1', how='left')

In [14]:
join_job.head()

    invoice    jobno     jobcat1        big        mid  manager_ind
0   4541302   788127  2008001006      研發相關類      工程研發類          0.0
1  22099218   881206  2008001016      研發相關類      工程研發類          0.0
2  84149738   962383  2008001009      研發相關類      工程研發類          0.0
3  76027628  3338171  2003001009   財會／金融專業類  財務／會計／稅務類          0.0
4   4541302  3716258  2010001009  操作／技術／維修類     操作／技術類          0.0

In [15]:
join_job.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1853835 entries, 0 to 1853834
Data columns (total 6 columns):
invoice        int64
jobno          int64
jobcat1        int64
big            object
mid            object
manager_ind    float64
dtypes: float64(1), int64(3), object(2)
memory usage: 99.0+ MB

In [50]:
# Save to_csv
join_job.to_csv('mapping_job_class.csv', index= False)